<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v2.3.1 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of RingCentral and imports it into Munki.</string>
	<key>Identifier</key>
	<string>com.github.dwbergstrom.munki.RingCentral</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/%NAME%</string>
		<key>NAME</key>
		<string>RingCentral</string>
		<key>pkginfo</key>
		<dict>
			<key>blocking_applications</key>
			<array>
				<string>Meetings Helper (Renderer).app</string>
				<string>airhost.app</string>
				<string>RingCentral.app</string>
				<string>aomhost.app</string>
				<string>RingCentral Helper (Renderer).app</string>
				<string>capHost.app</string>
				<string>RingCentral Helper (Plugin).app</string>
				<string>CptHost.app</string>
				<string>RcAppSipMedia.app</string>
				<string>Meetings.app</string>
				<string>Meetings Helper (GPU).app</string>
				<string>RingCentral Helper (GPU).app</string>
				<string>SDK_Transcode.app</string>
				<string>Meetings Helper.app</string>
				<string>RingCentral Helper.app</string>
				<string>Meetings Helper (Plugin).app</string>
			</array>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>description</key>
			<string>The app is a next-generation cloud-based video conference room solution.</string>
			<key>developer</key>
			<string>RingCentral, Inc.</string>
			<key>display_name</key>
			<string>RingCentral</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>2.3</string>
	<key>ParentRecipe</key>
	<string>com.github.dwbergstrom.download.RingCentral</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
